# Чернеги Вікторії   Б19_д/122Б
'''
Дан текстовий файл f, в кожному рядку якого перші два символи є літерами.
Записати у файл g слово, що утворюється першими буквами кожного рядка.
'''
import sys                              # імпортуваня бібліотеки

f = open('file.txt', 'r')               # відкриваю не пустий файл
list = []                               # список, для збереження перших букв рядка файлу f
for string in f:                        # цикл, для занесення у список перших букв рядка
    list.append(string[0])

stdout = sys.stdout                     # змінна теперішнього потоку, створена, щоб повернутись до нього
sys.stdout = open('g.txt', 'w')         # відкриття пустого файлу g як потоку виведення
for i in list:                          # цикл, для занесення у файл g елементи зі списку
    sys.stdout.write(i)                 # занесення у файл g елементів списку
    stdout.write(i)                     # запис у початкову змінну потоку і виведення результату
sys.stdout.close()                      # закриття файлу g
sys.stdout = stdout                     # повернення до початкової змінної потоку