# Чернеги Вікторії   Б19_д/122Б
'''
Дано файли f1, f2, f3, f4, f5, компоненти яких є дійсними числами. Організувати
обмін компонентами між файлами у відповідності з наступною схемою: f1 → f3, f2 → f4,
f3 → f5, f4 → f2, f5 → f1. Дозволяється використовувати тільки один допоміжний файл h.
'''

def changing(f, g):                 # функція, що записує в файл g дані з файлу f
    g.truncate(g.seek(0))           # видалення всього вмісту файлу g
    for string in f:                # цикл, для перенесення вмісту файла f у файл g
        g.write(string)


f1 = open('f1.txt', 'r+')           # відкриття всіх файлів
f2 = open('f2.txt', 'r+')
f3 = open('f3.txt', 'r+')
f4 = open('f4.txt', 'r+')
f5 = open('f5.txt', 'r+')
h = open('h.txt', 'r+')

'''1) f1 → f3, f3 → f5, f5 → f1'''
changing(f3, h)                     # копіювання у файл h(допоміжний) вмісту файла f3   (f3-->h)
changing(f1, f3)                    # копіювання у файл f3 вмісту файла f1      (f1-->f3)
changing(f5, f1)                    # копіювання у файл f1 вмісту файла f5      (f5-->f1)

h.close()                           # закриття і відкриття допоміжного файлу, для повторного використання
h = open('h.txt', 'r+')
changing(h, f5)                     # копіювання у файл f5 вмісту файла h (h = f3)      (h(f3)-->f5)

h.close()                           # закриття і відкриття допоміжного файлу, для повторного використання
h = open('h.txt', 'r+')
changing(f4, h)                     # копіювання у файл h вмісту файла f4      (f4-->h)
changing(f2, f4)                    # копіювання у файл f4 вмісту файла f2      (f2-->f4)

h.close()                           # закриття і відкриття допоміжного файлу, для повторного використання
h = open('h.txt', 'r+')
changing(h, f2)                     # копіювання у файл f2 вмісту файла h (h = f4)      (h(f4)-->f2)
